eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/radio/wifi/wfx_fmac_driver/firmware/sl_wfx_general_api.h
/**************************************************************************//**
 * Copyright 2018, Silicon Laboratories Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *****************************************************************************/

#ifndef _SL_WFX_GENERAL_API_H_
#define _SL_WFX_GENERAL_API_H_

#include <stdint.h>

#include "sl_wfx_general_error_api.h"

//< API Internal Version encoding
#define SL_WFX_API_VERSION_MINOR                 0x04
#define SL_WFX_API_VERSION_MAJOR                 0x02

#define SL_WFX_SSID_SIZE                         32
#define SL_WFX_MAC_ADDR_SIZE                     6
#define SL_WFX_BSSID_SIZE                        SL_WFX_MAC_ADDR_SIZE

#define GENERAL_INTERFACE_ID                     2

#define SL_WFX_MSG_ID_MASK                       0x00FF
#define SL_WFX_MSG_TYPE_MASK                     0x80
#define SL_WFX_MSG_SEQ_RANGE                     0x0007 //range of field 'host_count' in msginfo_bitfield_t

/* Message bases */
#define SL_WFX_REQ_BASE                          0x00
#define SL_WFX_CNF_BASE                          0x00
#define SL_WFX_IND_BASE                          SL_WFX_MSG_TYPE_MASK

/**
 * @brief List of possible transmission rates.
 *
 * Note that ERP-PBCC is not supported by the hardware. The rate indices for 22 Mbit/s and 33 Mbit/s are only provided for standard compatibility.@n
 * Data rates (in the names) are for 20 MHz channel operation. Corresponding data rates for 10 MHz channel operation are half of them.
 *
 * In this API, some parameters such as 'basic_rate_set' encode a list of rates in a bitstream format.@n
 *     for instance SUPPORTED_B_RATES_MASK = 0x0000000F @n
 *                  SUPPORTED_G_RATES_MASK = 0x00003FC0 @n
 *                  SUPPORTED_N_RATES_MASK = 0x003FC000
 */
typedef enum sl_wfx_rate_index_e {
  SL_WFX_RATE_INDEX_B_1MBPS                      = 0,      ///< Data rate 802.11b 1Mbps
  SL_WFX_RATE_INDEX_B_2MBPS                      = 1,      ///< Data rate 802.11b 2Mbps
  SL_WFX_RATE_INDEX_B_5P5MBPS                    = 2,      ///< Data rate 802.11b 5.5Mbps
  SL_WFX_RATE_INDEX_B_11MBPS                     = 3,      ///< Data rate 802.11b 11Mbps
  SL_WFX_RATE_INDEX_PBCC_22MBPS                  = 4,      ///<ERP-PBCC, not supported
  SL_WFX_RATE_INDEX_PBCC_33MBPS                  = 5,      ///<ERP-PBCC, not supported
  SL_WFX_RATE_INDEX_G_6MBPS                      = 6,      ///< Data rate 802.11g 6Mbps
  SL_WFX_RATE_INDEX_G_9MBPS                      = 7,      ///< Data rate 802.11g 9Mbps
  SL_WFX_RATE_INDEX_G_12MBPS                     = 8,      ///< Data rate 802.11g 12Mbps
  SL_WFX_RATE_INDEX_G_18MBPS                     = 9,      ///< Data rate 802.11g 18Mbps
  SL_WFX_RATE_INDEX_G_24MBPS                     = 10,     ///< Data rate 802.11g 24Mbps
  SL_WFX_RATE_INDEX_G_36MBPS                     = 11,     ///< Data rate 802.11g 36Mbps
  SL_WFX_RATE_INDEX_G_48MBPS                     = 12,     ///< Data rate 802.11g 48Mbps
  SL_WFX_RATE_INDEX_G_54MBPS                     = 13,     ///< Data rate 802.11g 54Mbps
  SL_WFX_RATE_INDEX_N_6P5MBPS                    = 14,     ///< Data rate 802.11n 6.5Mbps
  SL_WFX_RATE_INDEX_N_13MBPS                     = 15,     ///< Data rate 802.11n 13Mbps
  SL_WFX_RATE_INDEX_N_19P5MBPS                   = 16,     ///< Data rate 802.11n 19.5Mbps
  SL_WFX_RATE_INDEX_N_26MBPS                     = 17,     ///< Data rate 802.11n 26Mbps
  SL_WFX_RATE_INDEX_N_39MBPS                     = 18,     ///< Data rate 802.11n 39Mbps
  SL_WFX_RATE_INDEX_N_52MBPS                     = 19,     ///< Data rate 802.11n 52Mbps
  SL_WFX_RATE_INDEX_N_58P5MBPS                   = 20,     ///< Data rate 802.11n 58.5Mbps
  SL_WFX_RATE_INDEX_N_65MBPS                     = 21,     ///< Data rate 802.11n 65Mbps
  SL_WFX_RATE_NUM_ENTRIES                        = 22      ///< Number of defined data rates
} sl_wfx_rate_index_t;

/**
 * @addtogroup MESSAGE_CONSTRUCTION
 * @brief interface message formating
 *
 * The WLAN API handles 3 types of messages.
 * REQUEST, CONFIRMATION and INDICATION
 *
   \msc
   arcgradient = 8;
   a [label="Wlan"],b [label="Host"];
   a=>b [label="INDICATION"];
   b=>b [label="Process indication"];
   ...;
    ---;
   ...;
   a<=b [label="REQUEST"];
   a=>a [label="Process request"];
   a=>b [label="CONFIRMATION"];
   \endmsc
 *
 * WLAN can send an INDICATION message to the host at any time.@n
 * Host can send REQUEST to the WLAN and the WLAN will always answer to it (either immediately or after a while) with a CONFIRMATION.
 *
 * A message is composed of a header and a body (see sl_wfx_generic_msg_t).
 * In the rest of the API description, only the body is detailed for each message.
 *
 * @{
 */

/**
 * @brief General Message header structure
 *
 */
typedef struct __attribute__((__packed__)) sl_wfx_header_s {
  uint16_t length;                                         ///< Message length in bytes including this uint16_t.
                                                           ///< Maximum value is 8188 but maximum Request size is FW dependent and reported in the ::sl_wfx_startup_ind_body_t::size_inp_ch_buf.
  uint8_t  id;                                             ///< Contains the message Id indexed by sl_wfx_general_commands_ids_t or sl_wfx_message_ids_t.
  uint8_t  info;                                           ///< TODO comment missing
} sl_wfx_header_t;

/**
 * @brief Generic message structure for all requests, confirmations and indications
 *
 */
typedef struct __attribute__((__packed__)) sl_wfx_generic_message_s {
  sl_wfx_header_t header;                                  ///<4 bytes header
  uint8_t  body[];                                        ///<variable size payload of the message
} sl_wfx_generic_message_t;

/**
 * @brief Generic confirmation message with the body reduced to the status field.
 *
 * This structure is not related to a specific confirmation ID. @n
 * It is a global simplified structure that can be used to easily access the header and status fields.
 *
 * All confirmation bodies start with a status word and in a lot of them it is followed by other data (not present in this structure).
 */
typedef struct __attribute__((__packed__)) sl_wfx_generic_confirmation_s {
  sl_wfx_header_t header;                                  ///<4 bytes header
  uint32_t status;                                         ///<See enum sl_wfx_status_t and (wsm_status or wfm_status)
} sl_wfx_generic_confirmation_t;

/**
 * @}
 */

/**
 * @addtogroup GENERAL_API
 * @brief General API messages available in both split and full MAC.
 *
 * Mainly used to boot and configure the part.@n
 * But some message are also used to report errors or information.@n
 *@n
 * \arg general \b requests are sl_wfx_generic_requests_ids_t@n
 * \arg general \b indications are sl_wfx_general_indications_ids_t@n
 * @n
 * @{
 */

/**
 * @brief General request message IDs
 *
 * API general request message IDs available in both split and full MAC.
 * These are messages from the host towards the WLAN.
 */
typedef enum sl_wfx_generic_requests_ids_e {
  SL_WFX_CONFIGURATION_REQ_ID                    = 0x09,   ///< \b CONFIGURATION request Id use body sl_wfx_configuration_req_body_t and returns sl_wfx_configuration_cnf_body_t
  SL_WFX_CONTROL_GPIO_REQ_ID                     = 0x26,   ///< \b CONTROL_GPIO request Id use body sl_wfx_control_gpio_req_body_t and returns sl_wfx_control_gpio_cnf_body_t
  SL_WFX_SET_SECURELINK_MAC_KEY_REQ_ID           = 0x27,   ///< \b SET_SECURELINK_MAC_KEY request Id use body sl_wfx_set_securelink_mac_key_req_body_t and returns sl_wfx_set_securelink_mac_key_cnf_body_t
  SL_WFX_SECURELINK_EXCHANGE_PUB_KEYS_REQ_ID     = 0x28,   ///< \b SECURELINK_EXCHANGE_PUB_KEYS request Id use body sl_wfx_securelink_exchange_pub_keys_req_body_t and returns sl_wfx_securelink_exchange_pub_keys_cnf_body_t
  SL_WFX_SECURELINK_CONFIGURE_REQ_ID             = 0x29,   ///< \b SECURELINK_CONFIGURE request Id use body sl_wfx_securelink_configure_req_body_t and returns sl_wfx_securelink_exchange_pub_keys_cnf_body_t
  SL_WFX_PREVENT_ROLLBACK_REQ_ID                 = 0x2a,   ///< \b PREVENT_ROLLBACK request Id use body sl_wfx_prevent_rollback_req_body_t and returns sl_wfx_prevent_rollback_cnf_body_t
  SL_WFX_PTA_SETTINGS_REQ_ID                     = 0x2b,   ///< \b PTA_SETTINGS request Id use body sl_wfx_pta_settings_req_body_t and returns sl_wfx_pta_settings_cnf_body_t
  SL_WFX_PTA_PRIORITY_REQ_ID                     = 0x2c,   ///< \b PTA_PRIORITY request Id use body sl_wfx_pta_priority_req_body_t and returns sl_wfx_pta_priority_cnf_body_t
  SL_WFX_PTA_STATE_REQ_ID                        = 0x2d,   ///< \b PTA_STATE request Id use body sl_wfx_pta_state_req_body_t and returns sl_wfx_pta_state_cnf_body_t
  SL_WFX_SET_CCA_CONFIG_REQ_ID                   = 0x2e,   ///< \b SET_CCA_CONFIG request Id uses body sl_wfx_set_cca_config_req_body_t and returns sl_wfx_set_cca_config_cnf_body_t
  SL_WFX_SHUT_DOWN_REQ_ID                        = 0x32,   ///< \b SHUT_DOWN request Id use body sl_wfx_shut_down_req_t and never returns
} sl_wfx_generic_requests_ids_t;

/**
 * @brief General confirmation message IDs
 *
 * API general confirmation message IDs returned by requests described in sl_wfx_general_requests_ids.
 * These are messages from the WLAN towards the host.
 */
typedef enum sl_wfx_general_confirmations_ids_e {
  SL_WFX_CONFIGURATION_CNF_ID                    = 0x09,   ///< \b CONFIGURATION confirmation Id returns body sl_wfx_configuration_cnf_body_t
  SL_WFX_CONTROL_GPIO_CNF_ID                     = 0x26,   ///< \b CONTROL_GPIO confirmation Id returns body sl_wfx_control_gpio_cnf_body_t
  SL_WFX_SET_SECURELINK_MAC_KEY_CNF_ID           = 0x27,   ///< \b SET_SECURELINK_MAC_KEY confirmation Id returns body sl_wfx_set_securelink_mac_key_cnf_body_t
  SL_WFX_SECURELINK_EXCHANGE_PUB_KEYS_CNF_ID     = 0x28,   ///< \b SECURELINK_EXCHANGE_PUB_KEYS confirmation Id returns body sl_wfx_securelink_exchange_pub_keys_cnf_body_t
  SL_WFX_SECURELINK_CONFIGURE_CNF_ID             = 0x29,   ///< \b SECURELINK_CONFIGURE confirmation Id returns body sl_wfx_securelink_configure_cnf_body_t
  SL_WFX_PREVENT_ROLLBACK_CNF_ID                 = 0x2a,   ///< \b PREVENT_ROLLBACK confirmation Id use body sl_wfx_prevent_rollback_cnf_body_t
  SL_WFX_PTA_SETTINGS_CNF_ID                     = 0x2b,   ///< \b PTA_SETTINGS confirmation Id returns sl_wfx_pta_settings_cnf_body_t
  SL_WFX_PTA_PRIORITY_CNF_ID                     = 0x2c,   ///< \b PTA_PRIORITY confirmation Id returns sl_wfx_pta_priority_cnf_body_t
  SL_WFX_PTA_STATE_CNF_ID                        = 0x2d,   ///< \b PTA_STATE confirmation Id returns sl_wfx_pta_state_cnf_body_t
  SL_WFX_SET_CCA_CONFIG_CNF_ID                   = 0x2e,   ///< \b SET_CCA_CONFIG confirmation Id returns body sl_wfx_set_cca_config_cnf_body_t
} sl_wfx_general_confirmations_ids_t;

/**
 * @brief General indications message IDs
 *
 * API general indication message IDs available in both split and full MAC.
 * These are messages from the WLAN towards the host.
 */
typedef enum sl_wfx_general_indications_ids_e {
  SL_WFX_EXCEPTION_IND_ID                        = 0xe0,   ///< \b EXCEPTION indication Id content is sl_wfx_exception_ind_body_t
  SL_WFX_STARTUP_IND_ID                          = 0xe1,   ///< \b STARTUP indication Id content is sl_wfx_startup_ind_body_t
  SL_WFX_WAKEUP_IND_ID                           = 0xe2,   ///< \b WAKE UP indication Id has no content
  SL_WFX_GENERIC_IND_ID                          = 0xe3,   ///< \b GENERIC indication Id content is sl_wfx_generic_ind_body_t
  SL_WFX_ERROR_IND_ID                            = 0xe4,   ///< \b ERROR indication Id content is sl_wfx_error_ind_body_t
  SL_WFX_SECURELINK_EXCHANGE_PUB_KEYS_IND_ID     = 0xe5,   ///< \b SECURELINK_EXCHANGE_PUB_KEYS indication Id content is sl_wfx_securelink_exchange_pub_keys_ind_body_t
} sl_wfx_general_indications_ids_t;

/**
 * @brief General command message IDs
 *
 * All general API message IDs.
 */
typedef union __attribute__((__packed__)) sl_wfx_general_commands_ids_u {
  sl_wfx_generic_requests_ids_t request;                   ///< Request from the host to the WLAN device
  sl_wfx_general_confirmations_ids_t confirmation;         ///< Confirmation of a request from the WLAN device to the host
  sl_wfx_general_indications_ids_t indication;             ///< Indication from the WLAN device to the host
} sl_wfx_general_commands_ids_t;

/**************************************************/

/**
 * @brief General confirmation possible values for returned 'status' field
 * WLAN
 * All general confirmation messages have a field 'status' just after the message header.@n
 * A value of zero indicates the request is completed successfully.
 *
 */
typedef enum sl_wfx_status_e {
  SL_WFX_STATUS_SUCCESS                          = 0x0,    ///<The firmware has successfully completed the request.
  SL_WFX_STATUS_FAILURE                          = 0x1,    ///<This is a generic failure code : other error codes do not apply.
  SL_WFX_INVALID_PARAMETER                       = 0x2,    ///<The request contains one or more invalid parameters.
  SL_WFX_STATUS_GPIO_WARNING                     = 0x3,    ///<Warning : the GPIO CMD is successful but the read value is not as expected (likely a drive conflict on the line)
  SL_WFX_ERROR_UNSUPPORTED_MSG_ID                = 0x4,    ///<Unknown request ID or wrong interface ID used
  /* Specific SecureLink statuses */
  SL_WFX_MAC_KEY_STATUS_SUCCESS                  = 0x5A,   ///<Key has been correctly written
  SL_WFX_MAC_KEY_STATUS_FAILED_KEY_ALREADY_BURNED = 0x6B,  ///<Key already exists in OTP
  SL_WFX_MAC_KEY_STATUS_FAILED_RAM_MODE_NOT_ALLOWED = 0x7C, ///<RAM mode is not allowed
  SL_WFX_MAC_KEY_STATUS_FAILED_UNKNOWN_MODE      = 0x8D,   ///<Unknown mode (should be RAM or OTP)
  SL_WFX_PUB_KEY_EXCHANGE_STATUS_SUCCESS         = 0x9E,   ///<Host Public Key authenticated
  SL_WFX_PUB_KEY_EXCHANGE_STATUS_FAILED          = 0xAF,   ///<Host Public Key authentication failed
  /* Specific Prevent Rollback statuses */
  SL_WFX_PREVENT_ROLLBACK_CNF_SUCCESS            = 0x1234, ///<OTP rollback value has been successfully updated
  SL_WFX_PREVENT_ROLLBACK_CNF_WRONG_MAGIC_WORD   = 0x1256  ///<Wrong magic word detected
} sl_wfx_status_t;

/**************************************************/

/**
 * @addtogroup General_Configuration
 * @brief General configuration commands
 *
 *
 * @{
 */
typedef enum sl_wfx_type_e {
  SL_WFX_FW_TYPE_ETF                             = 0x0,    ///<Test Firmware
  SL_WFX_FW_TYPE_WFM                             = 0x1,    ///<WLAN Full MAC (WFM)
  SL_WFX_FW_TYPE_WSM                             = 0x2     ///<WLAN Split MAC (WSM)
} sl_wfx_fw_type_t;

/**
 * @brief Capabilities offered by the WLAN used in command sl_wfx_startup_ind_body_t
 */
typedef struct __attribute__((__packed__)) sl_wfx_capabilities_s {
  uint8_t  linkmode : 2;                                   ///<Bit 0-1 : OTP SecureLink mode. 0=reserved, 1=untrusted (no secure link supported), 2=evaluation mode (no key burnt), 3=active
  uint8_t  reserved1 : 6;                                  ///<Bit 2-7 : Reserved
  uint8_t  reserved2;                                      ///<Bit 8-15 : Reserved
  uint8_t  reserved3;                                      ///<Bit 16-23 : Reserved
  uint8_t  reserved4;                                      ///<Bit 24-31 : Reserved
} sl_wfx_capabilities_t;

/**
 * @brief REGUL_SEL_MODE OTP field reported in command sl_wfx_startup_ind_body_t
 */
typedef struct __attribute__((__packed__)) sl_wfx_otp_regul_sel_mode_info_s {
  uint8_t  region_sel_mode : 4;                            ///<Bit 0-3 : indicates default FW behavior regarding DFS region setting
                                                           ///<          0=Unrestricted, 1=SuperGlobal (enforces FCC, CE and Japan regulations depending on the automatic region detection)
                                                           ///<          2=SingleRegion (enforces FCC, CE or Japan depending on OTP tables content), 3=Reserved
  uint8_t  reserved : 4;                                   ///<Bit 4-7 : Reserved
} sl_wfx_otp_regul_sel_mode_info_t;

/**
 * @brief OTP_PHY_INFO OTP field reported in command sl_wfx_startup_ind_body_t
 */
typedef struct __attribute__((__packed__)) sl_wfx_otp_phy_info_s {
  uint8_t  phy1_region : 3;                                ///<Bit 0-2 : DFS region corresponding to backoff vs. channel group table indexed 1
  uint8_t  phy0_region : 3;                                ///<Bit 3-5 : DFS region corresponding to backoff vs. channel group table indexed 0
  uint8_t  otp_phy_ver : 2;                                ///<Bit 6-7 : Revision of OTP info
} sl_wfx_otp_phy_info_t;

#define SL_WFX_OPN_SIZE                          14
#define SL_WFX_UID_SIZE                          8
#define SL_WFX_DISABLED_CHANNEL_LIST_SIZE        2
#define SL_WFX_FIRMWARE_LABEL_SIZE               128
/**
 * @brief Startup Indication message.
 * This is the first message sent to the host to confirm boot success.
 * It gives detailed information on the HW and FW versions and capabilities
 */
typedef struct __attribute__((__packed__)) sl_wfx_startup_ind_body_s {
  uint32_t status;                                         ///<Initialization status. A value of zero indicates the boot is completed successfully  (see enum sl_wfx_status_t)
  uint16_t hardware_id;                                    ///<=RO misc_read_reg7 register value
  uint8_t  opn[SL_WFX_OPN_SIZE];                           ///<=OTP part_OPN
  uint8_t  uid[SL_WFX_UID_SIZE];                           ///<=OTP UID
  uint16_t num_inp_ch_bufs;                                ///<Number of buffers available for request messages.
  uint16_t size_inp_ch_buf;                                ///<TX Buffer size in bytes=request message max size.
  uint8_t  num_links_aP;                                   ///<number of STA that are supported in AP mode
  uint8_t  num_interfaces;                                 ///<number of interfaces (WIFI link : STA or AP) that can be created by the user
  uint8_t  mac_addr[2][SL_WFX_MAC_ADDR_SIZE];              ///<MAC addresses derived from OTP
  uint8_t  api_version_minor;
  uint8_t  api_version_major;
  sl_wfx_capabilities_t capabilities;                      ///<List some FW options
  uint8_t  firmware_build;
  uint8_t  firmware_minor;
  uint8_t  firmware_major;
  uint8_t  firmware_type;                                  ///<See enum sl_wfx_fw_type_t
  uint8_t  disabled_channel_list[SL_WFX_DISABLED_CHANNEL_LIST_SIZE]; ///<=OTP Disabled channel list info
  sl_wfx_otp_regul_sel_mode_info_t regul_sel_mode_info;    ///<OTP region selection mode info
  sl_wfx_otp_phy_info_t otp_phy_info;                      ///<info on OTP backoff tables used to enforce the different DFS regulations.
  uint32_t supported_rate_mask;                            ///<A bit mask that indicates which rates are supported by the Physical layer. See enum api_rate_index.
  uint8_t  firmware_label[SL_WFX_FIRMWARE_LABEL_SIZE];     ///<Null terminated text string describing the loaded FW.
} sl_wfx_startup_ind_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_startup_ind_s {
  sl_wfx_header_t header;
  sl_wfx_startup_ind_body_t body;
} sl_wfx_startup_ind_t;

/**
 * @brief Wake-up indication message.
 * @since API1.4.0
 *
 * Its body is empty. It signals that the chip is awake and ready to receive commands after a wake-up request from the host.
 * It generates a DATA_IRQ to the host driver when ready.
 * It can be replaced or passed by another message that would have appeared concurrently like a Rx frame.
 * */

typedef sl_wfx_header_t sl_wfx_wakeup_ind_t;

/**
 * @brief Configure the device.
 * It sends a PDS compressed file that configures the device regarding board dependent parameters.
 * The PDS compressed file must fit in a command buffer and have less than 256 elements.
 *
 * @todo Need to create a specific doc to explain PDS*/
typedef struct __attribute__((__packed__)) sl_wfx_configuration_req_body_s {
  uint16_t length;                                         ///<pds_data length in bytes
  uint8_t  pds_data[];                                    ///<variable size PDS data byte array
} sl_wfx_configuration_req_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_configuration_req_s {
  sl_wfx_header_t header;
  sl_wfx_configuration_req_body_t body;
} sl_wfx_configuration_req_t;

/**
 * @brief Confirmation message of CONFIGURATION command sl_wfx_configuration_req_body_t */
typedef struct __attribute__((__packed__)) sl_wfx_configuration_cnf_body_s {
  uint32_t status;                                         ///<Configuration status. A value of zero indicates the boot is completed successfully (see enum sl_wfx_status_t)
} sl_wfx_configuration_cnf_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_configuration_cnf_s {
  sl_wfx_header_t header;
  sl_wfx_configuration_cnf_body_t body;
} sl_wfx_configuration_cnf_t;

/**
 * @brief Configure GPIO mode. Used in sl_wfx_control_gpio_req_body_t
 * */
typedef enum sl_wfx_gpio_mode_e {
  SL_WFX_GPIO_MODE_D0                            = 0x0,    ///< Configure the GPIO to drive 0
  SL_WFX_GPIO_MODE_D1                            = 0x1,    ///< Configure the GPIO to drive 1
  SL_WFX_GPIO_MODE_OD0                           = 0x2,    ///< Configure the GPIO to open drain with pull_down to 0
  SL_WFX_GPIO_MODE_OD1                           = 0x3,    ///< Configure the GPIO to open drain with pull_up to 1
  SL_WFX_GPIO_MODE_TRISTATE                      = 0x4,    ///< Configure the GPIO to tristate
  SL_WFX_GPIO_MODE_TOGGLE                        = 0x5,    ///< Toggle the GPIO output value : switches between D0 and D1 or between OD0 and OD1
  SL_WFX_GPIO_MODE_READ                          = 0x6     ///< Read the level at the GPIO pin
} sl_wfx_gpio_mode_t;

/**
 * @brief Send a request to read or write a GPIO identified by its label (that is defined in the PDS)
 *
 * After a write it also read back the value to check there is no drive conflict */
typedef struct __attribute__((__packed__)) sl_wfx_control_gpio_req_body_s {
  uint8_t  gpio_label;                                     ///<Identify the GPIO by its label (defined in the PDS)
  uint8_t  gpio_mode;                                      ///<define how to set or read the GPIO (see enum sl_wfx_gpio_mode_t)
} sl_wfx_control_gpio_req_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_control_gpio_req_s {
  sl_wfx_header_t header;
  sl_wfx_control_gpio_req_body_t body;
} sl_wfx_control_gpio_req_t;

/**
 * @brief detailed error cause returned by CONTROL_GPIO confirmation message sl_wfx_control_gpio_cnf_body_t
 * */
typedef enum sl_wfx_gpio_error_e {
  SL_WFX_GPIO_ERROR_0                            = 0x0,    ///< Undefined GPIO_ID
  SL_WFX_GPIO_ERROR_1                            = 0x1,    ///< GPIO_ID not configured in GPIO mode (gpio_enabled =0)
  SL_WFX_GPIO_ERROR_2                            = 0x2     ///< Toggle not possible while in tristate
} sl_wfx_gpio_error_t;

