eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/radio/wifi/wfx_fmac_driver/firmware/sl_wfx_general_api.h
/**
 * @brief Confirmation from request to read and write a GPIO */
typedef struct __attribute__((__packed__)) sl_wfx_control_gpio_cnf_body_s {
  uint32_t status;                                         ///<enum sl_wfx_status_t : a value of zero indicates the request is completed successfully.
  uint32_t value;                                          ///<the error detail (see enum sl_wfx_gpio_error_t) when ::sl_wfx_control_gpio_cnf_body_t::status reports an error else the gpio read value.
} sl_wfx_control_gpio_cnf_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_control_gpio_cnf_s {
  sl_wfx_header_t header;
  sl_wfx_control_gpio_cnf_body_t body;
} sl_wfx_control_gpio_cnf_t;

/**
 * @brief SHUT_DOWN command.
 * A hardware reset and complete reboot is required to resume from that state.
 * There is no confirmation to this command.
 * It is effective when WUP register bit and WUP pin (when used) are both to 0.*/
typedef sl_wfx_header_t sl_wfx_shut_down_req_t;

/**
 * @brief specifies the type of data reported by the indication message sl_wfx_generic_ind_body_t
 *
 * */
typedef enum sl_wfx_generic_indication_type_e {
  SL_WFX_GENERIC_INDICATION_TYPE_RAW             = 0x0,    ///<Byte stream type, currently not used
  SL_WFX_GENERIC_INDICATION_TYPE_STRING          = 0x1,    ///<NULL terminating String
  SL_WFX_GENERIC_INDICATION_TYPE_RX_STATS        = 0x2,    ///<Rx statistics structure
  SL_WFX_GENERIC_INDICATION_TYPE_TX_PWR_LOOP_INFO = 0x3     ///<Tx power loop info structure
} sl_wfx_generic_indication_type_t;

/**
 * @brief RX stats from the GENERIC indication message sl_wfx_generic_ind_body_t
 */
typedef struct __attribute__((__packed__)) sl_wfx_rx_stats_s {
  uint32_t nb_rx_frame;                                    ///<Total number of frame received
  uint32_t nb_crc_frame;                                   ///<Number of frame received with bad CRC
  uint32_t per_total;                                      ///<PER on the total number of frame
  uint32_t throughput;                                     ///<Throughput calculated on correct frames received
  uint32_t nb_rx_by_rate[SL_WFX_RATE_NUM_ENTRIES];         ///<Number of frame received by rate
  uint16_t per[SL_WFX_RATE_NUM_ENTRIES];                   ///<PER*10000 by frame rate
  int16_t  snr[SL_WFX_RATE_NUM_ENTRIES];                   ///<SNR in Db*100 by frame rate
  int16_t  rssi[SL_WFX_RATE_NUM_ENTRIES];                  ///<RSSI in Dbm*100 by frame rate
  int16_t  cfo[SL_WFX_RATE_NUM_ENTRIES];                   ///<CFO in k_hz by frame rate
  uint32_t date;                                           ///<This message transmission date in firmware timebase (microsecond)
  uint32_t pwr_clk_freq;                                   ///<Frequency of the low power clock in Hz
  uint8_t  is_ext_pwr_clk;                                 ///<Indicate if the low power clock is external
  int8_t   current_temp;                                   ///<Current die temperature in Celsius
} sl_wfx_rx_stats_t;

/**
 * @brief TX power loop info from the GENERIC indication message sl_wfx_generic_ind_body_t
 */
typedef struct __attribute__((__packed__)) sl_wfx_tx_pwr_loop_info_s {
  uint16_t   dig_gain;                                     ///<Used Tx digital gain
  uint16_t   ppa_gain;                                     ///<Used Tx PA gain
  int16_t    target_pout;                                  ///<Power target in qdBm
  int16_t    pestimation;                                  ///<FEM output power in qdBm
  uint16_t   vpdet;                                        ///<Measured Vpdet in mV
  uint8_t    meas_index;                                   ///<Vpdet measurement index
  uint8_t    reserved;                                     ///<Reserved
} sl_wfx_tx_pwr_loop_info_t;

typedef union __attribute__((__packed__)) sl_wfx_indication_data_u {
  sl_wfx_rx_stats_t rx_stats;
  sl_wfx_tx_pwr_loop_info_t tx_pwr_loop_info;
  uint8_t  raw_data[376];
} sl_wfx_indication_data_t;

/**
 * @brief the Generic indication message.
 *
 * It reports different type of information that can be printed by the driver.
 * */
typedef struct __attribute__((__packed__)) sl_wfx_generic_ind_body_s {
  uint32_t indication_type;                                ///<Identify the indication data (see enum type sl_wfx_generic_indication_type_t)
  sl_wfx_indication_data_t indication_data;                ///<Indication data.
} sl_wfx_generic_ind_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_generic_ind_s {
  sl_wfx_header_t header;
  sl_wfx_generic_ind_body_t body;
} sl_wfx_generic_ind_t;

#define SL_WFX_EXCEPTION_DATA_SIZE_MAX          1600
/**
 * @brief Exception indication message
 *
 * It reports unexpected errors. A reboot is needed after this message.
 * */
typedef struct __attribute__((__packed__)) sl_wfx_exception_ind_body_s {
  uint32_t reason;                                         ///<Reason of the exception
  uint8_t  data[];                                         ///<Raw data array
} sl_wfx_exception_ind_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_exception_ind_s {
  sl_wfx_header_t header;
  sl_wfx_exception_ind_body_t body;
} sl_wfx_exception_ind_t;

/**
 * @brief Error indication message.
 *
 * It reports user configuration errors.
 * A reboot is needed after this message.
 * */
typedef struct __attribute__((__packed__)) sl_wfx_error_ind_body_s {
  uint32_t type;                                           ///<error type, see enum sl_wfx_error_t
  uint8_t  data[];                                         ///<Generic data buffer - contents depends on the error type.
} sl_wfx_error_ind_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_error_ind_s {
  sl_wfx_header_t header;
  sl_wfx_error_ind_body_t body;
} sl_wfx_error_ind_t;

/**
 * @}
 */
/* end of General_Configuration */

/******************************************************************************
 * Secure link section
 *****************************************************************************/
/**
 * @addtogroup Secure_Link
 * @brief APIs for Secure link configuration and usage.
 *
 * WFX family of product have the ability to encrypt the SDIO or SPI link.
 *
 * Link to more detailed documentation about the Secure Link feature : \ref SecureLink
 * @{
 */

/**
 * @brief *Secure Link' device state
 * */
typedef enum sl_wfx_secure_link_state_e {
  SECURE_LINK_NA_MODE                            = 0x0,    ///<Reserved
  SECURE_LINK_UNTRUSTED_MODE                     = 0x1,    ///<Untrusted mode - SecureLink not available
  SECURE_LINK_TRUSTED_MODE                       = 0x2,    ///<Trusted (Evaluation) mode
  SECURE_LINK_TRUSTED_ACTIVE_ENFORCED            = 0x3     ///<Trusted (Enforced) mode
} sl_wfx_secure_link_state_t;

/**
 * @brief destination of the *Secure Link MAC key*, used by request message sl_wfx_set_securelink_mac_key_req_body_t
 * */
typedef enum sl_wfx_securelink_mac_key_dest_e {
  SECURE_LINK_MAC_KEY_DEST_OTP                   = 0x78,   ///<Key will be stored in OTP
  SECURE_LINK_MAC_KEY_DEST_RAM                   = 0x87    ///<Key will be stored in RAM
} sl_wfx_securelink_mac_key_dest_t;

#define SL_WFX_KEY_VALUE_SIZE                    32

/**
 * @brief Set the Secure Link MAC key
 *
 * This API can be used for *Trusted Eval* devices in two contexts:
 * - to set a temporary *SecureLink MAC key* in RAM.
 * - to permanently burn the *SecureLink MAC key* in OTP memory. In that case, the OTP *SecureLink mode* will
 * switch to *Trusted Enforced* mode
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_securemink_mac_key_req_body_s {
  uint8_t  otp_or_ram;                                     ///<Key destination - OTP or RAM (see enum sl_wfx_securelink_mac_key_dest_t)
  uint8_t  key_value[SL_WFX_KEY_VALUE_SIZE];               ///<Secure Link MAC Key value
} sl_wfx_set_securelink_mac_key_req_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_set_securelink_mac_key_req_s {
  sl_wfx_header_t header;
  sl_wfx_set_securelink_mac_key_req_body_t body;
} sl_wfx_set_securelink_mac_key_req_t;

/**
 * @brief Confirmation for the Secure Link MAC key setting
 * */
typedef struct __attribute__((__packed__)) sl_wfx_set_securelink_mac_key_cnf_body_s {
  uint32_t status;                                         ///<Key upload status (see enum sl_wfx_status_t)
} sl_wfx_set_securelink_mac_key_cnf_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_set_securelink_mac_key_cnf_s {
  sl_wfx_header_t header;
  sl_wfx_set_securelink_mac_key_cnf_body_t body;
} sl_wfx_set_securelink_mac_key_cnf_t;

#define SL_WFX_HOST_PUB_KEY_SIZE                 32
#define SL_WFX_HOST_PUB_KEY_MAC_SIZE             64

/**
 * @brief Session Key computation algorithms
 *
 */
typedef enum sl_wfx_secure_link_session_key_alg_e {
  SECURE_LINK_CURVE25519                         = 0x01,   ///< Session key is computed using curve25519 algorithm
  SECURE_LINK_KDF                                = 0x02    ///< Session key is computed using KDF algorithm (not available yet)
} sl_wfx_secure_link_session_key_alg_t;

/**
 * @brief Exchange Secure Link Public Keys
 *
 * This API is used by the Host to send its *curve25519* public key to Device, and get back Device public key in the confirmation message.
 * Once keys are exchanged and authenticated (using their respective MAC), each peer computes the Secure Link *session key* that will be used
 * to encrypt/decrypt future Host<->Device messages.
 */
typedef struct __attribute__((__packed__)) sl_wfx_securelink_exchange_pub_keys_req_body_s {
  uint32_t algorithm;                                      ///<Choice of the cryptographic algorithm used in the session key computation (see enum sl_wfx_secure_link_session_key_alg_t)
  uint8_t  host_pub_key[SL_WFX_HOST_PUB_KEY_SIZE];         ///<Host Public Key
  uint8_t  host_pub_key_mac[SL_WFX_HOST_PUB_KEY_MAC_SIZE]; ///<Host Public Key MAC
} sl_wfx_securelink_exchange_pub_keys_req_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_securelink_exchange_pub_keys_req_s {
  sl_wfx_header_t header;
  sl_wfx_securelink_exchange_pub_keys_req_body_t body;
} sl_wfx_securelink_exchange_pub_keys_req_t;

/**
 * @brief Confirmation for exchange of Secure Link Public Keys
 * */
typedef struct __attribute__((__packed__)) sl_wfx_securelink_exchange_pub_keys_cnf_body_s {
  uint32_t status;                                         ///<Request status (see enum sl_wfx_status_t)
} sl_wfx_securelink_exchange_pub_keys_cnf_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_securelink_exchange_pub_keys_cnf_s {
  sl_wfx_header_t header;
  sl_wfx_securelink_exchange_pub_keys_cnf_body_t body;
} sl_wfx_securelink_exchange_pub_keys_cnf_t;

