eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/radio/wifi/wfx_fmac_driver/firmware/sl_wfx_general_api.h
#define SL_WFX_NCP_PUB_KEY_SIZE                  32
#define SL_WFX_NCP_PUB_KEY_MAC_SIZE              64
/**
 * @brief Indication for exchange of Secure Link Public Keys
 * */
typedef struct __attribute__((__packed__)) sl_wfx_securelink_exchange_pub_keys_ind_body_s {
  uint32_t status;                                         ///<Request status (see enum sl_wfx_status_t)
  uint8_t  ncp_pub_key[SL_WFX_NCP_PUB_KEY_SIZE];           ///<Device Public Key
  uint8_t  ncp_pub_key_mac[SL_WFX_NCP_PUB_KEY_MAC_SIZE];   ///<Device Public Key MAC
} sl_wfx_securelink_exchange_pub_keys_ind_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_securelink_exchange_pub_keys_ind_s {
  sl_wfx_header_t header;
  sl_wfx_securelink_exchange_pub_keys_ind_body_t body;
} sl_wfx_securelink_exchange_pub_keys_ind_t;

#define SL_WFX_SESSION_KEY_PROTECTION_DISABLE_MAGIC        0xfa21e603 ///< Magic word used to disable Session Key protection

#define SL_WFX_ENCR_BMP_SIZE                     32

/**
 * @brief Configure Secure Link Layer
 *
 * This API can be used to:
 * - Set/update the Secure Link *encryption bitmap*
 * - Disable Session Key Protection
 *
 * About the Session Key protection:
 * SecureLink underlying encryption algorithm is AES CCM. This algorithm is using an internal Nonce counter incremented each time a message is
 * encrypted/decrypted. This counter is not supposed to go beyond a given limit to guarantee AES CCM security properties.
 * This is why Host Driver is responsible for renegotiating the session key once the message counter is approaching the limit.
 * Disabling the Session Key protection will disable the check performed by the firmware that the Nonce counter is crossing the limit,
 * allowing Host Driver to use the same session key during the same power cycle, even during a very long time.
 * This behavior is not recommended.
 *
 * To disable the protection, a given magic word (SL_WFX_SESSION_KEY_PROTECTION_DISABLE_MAGIC) must be provided as _DisableSessionKeyProtection_ parameter value. Any other value will let the protection set.
 *
 * @note When SecureLink is activated, _SL Configure_ API must be called right after the key exchange.
 * @note It is not recommended to call this API a second time during the same power cycle.
 */
typedef struct __attribute__((__packed__)) sl_wfx_securelink_configure_req_body_s {
  uint8_t  encr_bmp[SL_WFX_ENCR_BMP_SIZE];                 ///<Encryption bitmap
  uint32_t disable_session_key_protection;                 ///<Force the firmware to authorize the use of the same session key during a complete power cycle, even very long. NOT RECOMMENDED
} sl_wfx_securelink_configure_req_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_securelink_configure_req_s {
  sl_wfx_header_t header;
  sl_wfx_securelink_configure_req_body_t body;
} sl_wfx_securelink_configure_req_t;

/**
 * @brief Confirmation of Secure Link Layer configuration sl_wfx_securelink_configure_req_body_t
 *
 * The following situation will lead to a SL_WFX_STATUS_FAILURE return value:
 * - Bitmap is set to 1 for SL_WFX_SEND_FRAME_REQ_ID (since encryption is not supported for TX frames)
 * */
typedef struct __attribute__((__packed__)) sl_wfx_securelink_configure_cnf_body_s {
  uint32_t status;                                         ///<Request status (see enum wsm_status)
} sl_wfx_securelink_configure_cnf_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_securelink_configure_cnf_s {
  sl_wfx_header_t header;
  sl_wfx_securelink_configure_cnf_body_t body;
} sl_wfx_securelink_configure_cnf_t;

/**
 * @}
 */
/* end of Secure_Link */

/******************************************************************************
 * Prevent Rollback section
 *****************************************************************************/
/**
 * @addtogroup Prevent_Firmware_Rollback
 * @brief APIs for preventing Rollback of unsafe firmware images.
 *
 * By enabling this feature Device can prevent unsafe/outdated firmware from booting.
 *
 * Each firmware owns its internal *rollback revision number* which is compared to
 *   an equivalent revision number burned in Device OTP memory. Depending on the comparison result,
 *   two use cases can occur:
 * - Firmware revision number is higher or equal to the OTP number -> the firmware is allowed
 *   to proceed
 * - Firmware revision number is lower than the OTP value -> the firmware is not allowed to proceed.
 *   An *Error indication* will be returned to the driver indicating the cause of the error (SL_WFX_ERROR_FIRMWARE_ROLLBACK).
 *
 * @note The firmware *rollback revision number* is different that the *firmware version*.
 * The former is incremented only when some important fixes (i.e., Security patches) are provided
 * by a given version of the firmware,that MUST be applied to Device and should not be reverted.
 *  Usually, subsequent firmware versions are supposed to embed the same rollback revision number.
 *
 * The rollback capability relies on the use of a dedicated API sl_wfx_prevent_rollback_req_body_t.
 *
 * All Device drivers supporting *Rollback Prevention* should send this request just after booting a new firmware.
 *   This way, any newer *rollback revision number* included in a firmware will be burned in the OTP.
 *
 * @{
 */

/**
 *@brief Prevent Rollback request
 *
 * *Prevent Rollback* asks WLAN firmware to burn a new *Firmware Rollback* value in a dedicated OTP section.
 *
 * The new value is encoded in the firmware itself. After it is burned, this value will prevent from starting
 *  all firmwares whose internal rollback value is lower than the OTP value.
 *
 * *Magic Word* is used to prevent mistakenly sent requests from burning the OTP.
 *
 */
typedef struct __attribute__((__packed__)) sl_wfx_prevent_rollback_req_body_s {
  uint32_t magic_word;                                     ///<Magic Word - should be 0x5C8912F3
} sl_wfx_prevent_rollback_req_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_prevent_rollback_req_s {
  sl_wfx_header_t header;
  sl_wfx_prevent_rollback_req_body_t body;
} sl_wfx_prevent_rollback_req_t;

/**
 * @brief Confirmation of the *Prevent Rollback* request
 *
 * The request might have failed for the following reasons:
 * - Wrong *magic word* value
 *
 */
typedef struct __attribute__((__packed__)) sl_wfx_prevent_rollback_cnf_body_s {
  uint32_t status;                                         ///<Confirmation status, see enum sl_wfx_status_t
} sl_wfx_prevent_rollback_cnf_body_t;

