eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/radio/wifi/wfx_fmac_driver/firmware/sl_wfx_general_api.h
typedef struct __attribute__((__packed__)) sl_wfx_pta_priority_req_s {
  sl_wfx_header_t header;
  sl_wfx_pta_priority_req_body_t body;
} sl_wfx_pta_priority_req_t;

/**
 * @brief Confirmation sent by WLAN firmware after a ::SL_WFX_PTA_PRIORITY_REQ_ID request.
 */
typedef struct __attribute__((__packed__)) sl_wfx_pta_priority_cnf_body_s {
  uint32_t status;                                         ///< Confirmation status, see enum ::sl_wfx_status_t
} sl_wfx_pta_priority_cnf_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_pta_priority_cnf_s {
  sl_wfx_header_t header;
  sl_wfx_pta_priority_cnf_body_t body;
} sl_wfx_pta_priority_cnf_t;

/**
 * @brief PTA states.
 */
typedef enum sl_wfx_pta_state_e {
  SL_WFX_PTA_OFF                                 = 0,      ///< PTA is off
  SL_WFX_PTA_ON                                  = 1       ///< PTA is on
} sl_wfx_pta_state_t;

/**
 * @brief Request sent by host to start or stop the PTA.
 * @note Starting PTA will fail if not first configured with ::sl_wfx_pta_settings_req_body_t request.
 */
typedef struct __attribute__((__packed__)) sl_wfx_pta_state_req_body_s {
  uint32_t pta_state;                                      ///< Requested PTA state, see enum ::sl_wfx_pta_state_t
} sl_wfx_pta_state_req_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_pta_state_req_s {
  sl_wfx_header_t header;
  sl_wfx_pta_state_req_body_t body;
} sl_wfx_pta_state_req_t;

/**
 * @brief Confirmation sent by WLAN firmware after a ::SL_WFX_PTA_STATE_REQ_ID request.
 */
typedef struct __attribute__((__packed__)) sl_wfx_pta_state_cnf_body_s {
  uint32_t status;                                         ///< Confirmation status, see enum ::sl_wfx_status_t
} sl_wfx_pta_state_cnf_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_pta_state_cnf_s {
  sl_wfx_header_t header;
  sl_wfx_pta_state_cnf_body_t body;
} sl_wfx_pta_state_cnf_t;

/**
 * @}
 */
/* end of PTA section */

/**
 * @brief CCA Mode definition
 * */
typedef enum sl_wfx_cc_thr_mode_e {
  SL_WFX_CCA_THR_MODE_RELATIVE = 0x0,                      ///< Use CCA defer threshold relative to channel noise
  SL_WFX_CCA_THR_MODE_ABSOLUTE = 0x1                       ///< Use absolute CCA defer threshold
} sl_wfx_cc_thr_mode_t;

/**
 * @brief Request sent by host to set the Clear Channel Assessment configuration
 * Set the CCA mode and the defer threshold
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_cca_config_req_body_s {
  uint8_t  cca_thr_mode;                                   ///< CCA threshold mode. See enum ::sl_wfx_cc_thr_mode_t.
  uint8_t  reserved[3];                                    ///< reserved for future use, set to 0
} sl_wfx_set_cca_config_req_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_set_cca_config_req_s {
  sl_wfx_header_t header;
  sl_wfx_set_cca_config_req_body_t body;
} sl_wfx_set_cca_config_req_t;

/**
 * @brief Confirmation sent by Wlan firmware after a ::SL_WFX_SET_CCA_CONFIG_REQ_ID request.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_cca_config_cnf_body_s {
  uint32_t status;                                         ///< Confirmation status, see enum ::sl_wfx_status_t
} sl_wfx_set_cca_config_cnf_body_t;

typedef struct __attribute__((__packed__)) sl_wfx_set_cca_config_s {
  sl_wfx_header_t header;
  sl_wfx_set_cca_config_cnf_body_t body;
} sl_wfx_set_cca_config_t;

/**
 * @}
 */
/*end of GENERAL_API */

#endif /* _SL_WFX_GENERAL_API_H_ */
